---
kind: other
id: Methods.T:Autodesk.Revit.DB.MEPAnalyticalConnectionType
source: html/53d8e3a2-a3a2-03f0-16cc-8befd5e37e64.htm
---
# MEPAnalyticalConnectionType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.